ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/mcspi.h
#define MCSPI_FLR_TXFL_Msk (0x3fu << MCSPI_FLR_TXFL_Pos) /**< \brief (MCSPI_FLR) Transmit FIFO Level */
#define MCSPI_FLR_RXFL_Pos 16
#define MCSPI_FLR_RXFL_Msk (0x3fu << MCSPI_FLR_RXFL_Pos) /**< \brief (MCSPI_FLR) Receive FIFO Level */
/* -------- MCSPI_CMPR : (MCSPI Offset: 0x48) Comparison Register -------- */
#define MCSPI_CMPR_VAL1_Pos 0
#define MCSPI_CMPR_VAL1_Msk (0xffffu << MCSPI_CMPR_VAL1_Pos) /**< \brief (MCSPI_CMPR) First Comparison Value for Received Character */
#define MCSPI_CMPR_VAL1(value) ((MCSPI_CMPR_VAL1_Msk & ((value) << MCSPI_CMPR_VAL1_Pos)))
#define MCSPI_CMPR_VAL2_Pos 16
#define MCSPI_CMPR_VAL2_Msk (0xffffu << MCSPI_CMPR_VAL2_Pos) /**< \brief (MCSPI_CMPR) Second Comparison Value for Received Character */
#define MCSPI_CMPR_VAL2(value) ((MCSPI_CMPR_VAL2_Msk & ((value) << MCSPI_CMPR_VAL2_Pos)))
/* -------- MCSPI_CRCR : (MCSPI Offset: 0x4C) CRC Register -------- */
#define MCSPI_CRCR_FRL_Pos 0
#define MCSPI_CRCR_FRL_Msk (0xffu << MCSPI_CRCR_FRL_Pos) /**< \brief (MCSPI_CRCR) Frame Length */
#define MCSPI_CRCR_FRL(value) ((MCSPI_CRCR_FRL_Msk & ((value) << MCSPI_CRCR_FRL_Pos)))
#define MCSPI_CRCR_CRCS (0x1u << 16) /**< \brief (MCSPI_CRCR) CRC Size */
#define   MCSPI_CRCR_CRCS_16B_CRC (0x0u << 16) /**< \brief (MCSPI_CRCR) CRC size is 16 bits. */
#define   MCSPI_CRCR_CRCS_32B_CRC (0x1u << 16) /**< \brief (MCSPI_CRCR) CRC size is 32 bits. */
#define MCSPI_CRCR_FRHL_Pos 20
#define MCSPI_CRCR_FRHL_Msk (0xfu << MCSPI_CRCR_FRHL_Pos) /**< \brief (MCSPI_CRCR) Frame Header Length */
#define MCSPI_CRCR_FRHL(value) ((MCSPI_CRCR_FRHL_Msk & ((value) << MCSPI_CRCR_FRHL_Pos)))
#define MCSPI_CRCR_CRM (0x1u << 24) /**< \brief (MCSPI_CRCR) Continuous Read Mode */
#define MCSPI_CRCR_FHE (0x1u << 25) /**< \brief (MCSPI_CRCR) Frame Header Excluded */
#define MCSPI_CRCR_DCRX (0x1u << 26) /**< \brief (MCSPI_CRCR) Disable CRC Receiving */
#define MCSPI_CRCR_DHRX (0x1u << 27) /**< \brief (MCSPI_CRCR) Disable Header Receiving */
/* -------- MCSPI_TPMR : (MCSPI Offset: 0x50) Two-Pin Mode Register -------- */
#define MCSPI_TPMR_CSM (0x1u << 0) /**< \brief (MCSPI_TPMR) Chip Select Mode */
#define MCSPI_TPMR_MIL (0x1u << 1) /**< \brief (MCSPI_TPMR) Multiple Input Lines */
#define MCSPI_TPMR_OSR_Pos 2
#define MCSPI_TPMR_OSR_Msk (0x3u << MCSPI_TPMR_OSR_Pos) /**< \brief (MCSPI_TPMR) OverSampling Rate */
#define MCSPI_TPMR_OSR(value) ((MCSPI_TPMR_OSR_Msk & ((value) << MCSPI_TPMR_OSR_Pos)))
/* -------- MCSPI_TPHR : (MCSPI Offset: 0x54) Two-Pin Header Register -------- */
#define MCSPI_TPHR_CNT_Pos 0
#define MCSPI_TPHR_CNT_Msk (0x3u << MCSPI_TPHR_CNT_Pos) /**< \brief (MCSPI_TPHR) Frame Counter */
#define MCSPI_TPHR_BOOST (0x1u << 2) /**< \brief (MCSPI_TPHR) Current Boost */
#define MCSPI_TPHR_GAIN_Pos 3
#define MCSPI_TPHR_GAIN_Msk (0x3u << MCSPI_TPHR_GAIN_Pos) /**< \brief (MCSPI_TPHR) Gain */
#define MCSPI_TPHR_OSR_Pos 5
#define MCSPI_TPHR_OSR_Msk (0x3u << MCSPI_TPHR_OSR_Pos) /**< \brief (MCSPI_TPHR) OverSampling Rate */
/* -------- MCSPI_WPMR : (MCSPI Offset: 0xE4) Write Protection Mode Register -------- */
#define MCSPI_WPMR_WPEN (0x1u << 0) /**< \brief (MCSPI_WPMR) Write Protection Enable */
#define MCSPI_WPMR_WPITEN (0x1u << 1) /**< \brief (MCSPI_WPMR) Write Protection Interrupt Enable */
#define MCSPI_WPMR_WPCREN (0x1u << 2) /**< \brief (MCSPI_WPMR) Write Protection Control Register Enable */
#define MCSPI_WPMR_WPKEY_Pos 8
#define MCSPI_WPMR_WPKEY_Msk (0xffffffu << MCSPI_WPMR_WPKEY_Pos) /**< \brief (MCSPI_WPMR) Write Protection Key */
#define MCSPI_WPMR_WPKEY(value) ((MCSPI_WPMR_WPKEY_Msk & ((value) << MCSPI_WPMR_WPKEY_Pos)))
#define   MCSPI_WPMR_WPKEY_PASSWD (0x535049u << 8) /**< \brief (MCSPI_WPMR) Writing any other value in this field aborts the write operation of WPEN. Always reads as 0. */
/* -------- MCSPI_WPSR : (MCSPI Offset: 0xE8) Write Protection Status Register -------- */
#define MCSPI_WPSR_WPVS (0x1u << 0) /**< \brief (MCSPI_WPSR) Write Protection Violation Status */
#define MCSPI_WPSR_WPVSRC_Pos 8
#define MCSPI_WPSR_WPVSRC_Msk (0xffu << MCSPI_WPSR_WPVSRC_Pos) /**< \brief (MCSPI_WPSR) Write Protection Violation Source */
/* -------- MCSPI_RPR : (MCSPI Offset: 0x100) Receive Pointer Register -------- */
#define MCSPI_RPR_RXPTR_Pos 0
#define MCSPI_RPR_RXPTR_Msk (0xffffffffu << MCSPI_RPR_RXPTR_Pos) /**< \brief (MCSPI_RPR) Receive Pointer Register */
#define MCSPI_RPR_RXPTR(value) ((MCSPI_RPR_RXPTR_Msk & ((value) << MCSPI_RPR_RXPTR_Pos)))
/* -------- MCSPI_RCR : (MCSPI Offset: 0x104) Receive Counter Register -------- */
#define MCSPI_RCR_RXCTR_Pos 0
#define MCSPI_RCR_RXCTR_Msk (0xffffu << MCSPI_RCR_RXCTR_Pos) /**< \brief (MCSPI_RCR) Receive Counter Register */
#define MCSPI_RCR_RXCTR(value) ((MCSPI_RCR_RXCTR_Msk & ((value) << MCSPI_RCR_RXCTR_Pos)))
/* -------- MCSPI_TPR : (MCSPI Offset: 0x108) Transmit Pointer Register -------- */
#define MCSPI_TPR_TXPTR_Pos 0
#define MCSPI_TPR_TXPTR_Msk (0xffffffffu << MCSPI_TPR_TXPTR_Pos) /**< \brief (MCSPI_TPR) Transmit Counter Register */
#define MCSPI_TPR_TXPTR(value) ((MCSPI_TPR_TXPTR_Msk & ((value) << MCSPI_TPR_TXPTR_Pos)))
/* -------- MCSPI_TCR : (MCSPI Offset: 0x10C) Transmit Counter Register -------- */
#define MCSPI_TCR_TXCTR_Pos 0
#define MCSPI_TCR_TXCTR_Msk (0xffffu << MCSPI_TCR_TXCTR_Pos) /**< \brief (MCSPI_TCR) Transmit Counter Register */
#define MCSPI_TCR_TXCTR(value) ((MCSPI_TCR_TXCTR_Msk & ((value) << MCSPI_TCR_TXCTR_Pos)))
/* -------- MCSPI_RNPR : (MCSPI Offset: 0x110) Receive Next Pointer Register -------- */
#define MCSPI_RNPR_RXNPTR_Pos 0
#define MCSPI_RNPR_RXNPTR_Msk (0xffffffffu << MCSPI_RNPR_RXNPTR_Pos) /**< \brief (MCSPI_RNPR) Receive Next Pointer */
#define MCSPI_RNPR_RXNPTR(value) ((MCSPI_RNPR_RXNPTR_Msk & ((value) << MCSPI_RNPR_RXNPTR_Pos)))
/* -------- MCSPI_RNCR : (MCSPI Offset: 0x114) Receive Next Counter Register -------- */
#define MCSPI_RNCR_RXNCTR_Pos 0
#define MCSPI_RNCR_RXNCTR_Msk (0xffffu << MCSPI_RNCR_RXNCTR_Pos) /**< \brief (MCSPI_RNCR) Receive Next Counter */
#define MCSPI_RNCR_RXNCTR(value) ((MCSPI_RNCR_RXNCTR_Msk & ((value) << MCSPI_RNCR_RXNCTR_Pos)))
/* -------- MCSPI_TNPR : (MCSPI Offset: 0x118) Transmit Next Pointer Register -------- */
#define MCSPI_TNPR_TXNPTR_Pos 0
#define MCSPI_TNPR_TXNPTR_Msk (0xffffffffu << MCSPI_TNPR_TXNPTR_Pos) /**< \brief (MCSPI_TNPR) Transmit Next Pointer */
#define MCSPI_TNPR_TXNPTR(value) ((MCSPI_TNPR_TXNPTR_Msk & ((value) << MCSPI_TNPR_TXNPTR_Pos)))
/* -------- MCSPI_TNCR : (MCSPI Offset: 0x11C) Transmit Next Counter Register -------- */
#define MCSPI_TNCR_TXNCTR_Pos 0
#define MCSPI_TNCR_TXNCTR_Msk (0xffffu << MCSPI_TNCR_TXNCTR_Pos) /**< \brief (MCSPI_TNCR) Transmit Counter Next */
#define MCSPI_TNCR_TXNCTR(value) ((MCSPI_TNCR_TXNCTR_Msk & ((value) << MCSPI_TNCR_TXNCTR_Pos)))
/* -------- MCSPI_PTCR : (MCSPI Offset: 0x120) Transfer Control Register -------- */
#define MCSPI_PTCR_RXTEN (0x1u << 0) /**< \brief (MCSPI_PTCR) Receiver Transfer Enable */
#define MCSPI_PTCR_RXTDIS (0x1u << 1) /**< \brief (MCSPI_PTCR) Receiver Transfer Disable */
#define MCSPI_PTCR_TXTEN (0x1u << 8) /**< \brief (MCSPI_PTCR) Transmitter Transfer Enable */
#define MCSPI_PTCR_TXTDIS (0x1u << 9) /**< \brief (MCSPI_PTCR) Transmitter Transfer Disable */
#define MCSPI_PTCR_RXCBEN (0x1u << 16) /**< \brief (MCSPI_PTCR) Receiver Circular Buffer Enable */
#define MCSPI_PTCR_RXCBDIS (0x1u << 17) /**< \brief (MCSPI_PTCR) Receiver Circular Buffer Disable */
#define MCSPI_PTCR_TXCBEN (0x1u << 18) /**< \brief (MCSPI_PTCR) Transmitter Circular Buffer Enable */
#define MCSPI_PTCR_TXCBDIS (0x1u << 19) /**< \brief (MCSPI_PTCR) Transmitter Circular Buffer Disable */
#define MCSPI_PTCR_ERRCLR (0x1u << 24) /**< \brief (MCSPI_PTCR) Transfer Bus Error Clear */
/* -------- MCSPI_PTSR : (MCSPI Offset: 0x124) Transfer Status Register -------- */
#define MCSPI_PTSR_RXTEN (0x1u << 0) /**< \brief (MCSPI_PTSR) Receiver Transfer Enable */
#define MCSPI_PTSR_TXTEN (0x1u << 8) /**< \brief (MCSPI_PTSR) Transmitter Transfer Enable */
#define MCSPI_PTSR_RXCBEN (0x1u << 16) /**< \brief (MCSPI_PTSR) Receiver Circular Buffer Enable */
#define MCSPI_PTSR_TXCBEN (0x1u << 18) /**< \brief (MCSPI_PTSR) Transmitter Circular Buffer Enable */
#define MCSPI_PTSR_ERR (0x1u << 24) /**< \brief (MCSPI_PTSR) Transfer Bus Error */
/* -------- MCSPI_PWPMR : (MCSPI Offset: 0x128) Write Protection Mode Register -------- */
#define MCSPI_PWPMR_WPPTREN (0x1u << 0) /**< \brief (MCSPI_PWPMR) Write Protection Pointer Registers Enable */
#define MCSPI_PWPMR_WPCTREN (0x1u << 1) /**< \brief (MCSPI_PWPMR) Write Protection Counter Registers Enable */
#define MCSPI_PWPMR_WPCREN (0x1u << 2) /**< \brief (MCSPI_PWPMR) Write Protection Control Register Enable */
#define MCSPI_PWPMR_WPKEY_Pos 8
#define MCSPI_PWPMR_WPKEY_Msk (0xffffffu << MCSPI_PWPMR_WPKEY_Pos) /**< \brief (MCSPI_PWPMR) Write Protection Key */
#define MCSPI_PWPMR_WPKEY(value) ((MCSPI_PWPMR_WPKEY_Msk & ((value) << MCSPI_PWPMR_WPKEY_Pos)))
#define   MCSPI_PWPMR_WPKEY_PASSWD (0x504443u << 8) /**< \brief (MCSPI_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */

/*@}*/


#endif /* _PIC32CX_MCSPI_COMPONENT_ */
